src/Catalogs/СпособыРаспределенияЗатратНаВыпуск/СпособыРаспределенияЗатратНаВыпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыРаспределенияЗатратНаВыпуск</name>
  <comment>(Общ)</comment>
  <predefined>
    <items>
      <name>ПоВыручкеОтРеализации</name>
      <description>По выручке от реализации</description>
    </items>
    <items>
      <name>ПоМатериальнымЗатратам</name>
      <description>По материальным затратам</description>
    </items>
    <items>
      <name>ПоНормативам</name>
      <description>По нормативам</description>
    </items>
    <items>
      <name>ПоОбъемуВыпуска</name>
      <description>По объему выпуска</description>
    </items>
    <items>
      <name>ПоОплатеТруда</name>
      <description>По оплате труда</description>
    </items>
    <items>
      <name>ПоПлановойСебестоимости</name>
      <description>По плановой себестоимости</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратНаВыпуск</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СпособыРаспределенияЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФильтраПриРаспределенииЗатратНаВыпуск</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ТипыФильтровПриРаспределенииЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияЗатрат</name>
    <type>
      <types>EnumRef.БазыРаспределенияЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательБазыРаспределения</name>
    <type>
      <types>EnumRef.ВидыПоказателейБазыРаспределения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСырье</name>
    <type>
      <types>CatalogRef.ОсновноеСырье</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратПоПодразделениям</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьНаСобственнуюПродукцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьНаПродукциюСтороннегоПереработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьНаПродукциюИзДавальческогоСырья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьНаПодчиненныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьНаНаработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиПостроителя</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьНаПроцент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьНаКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглитьДо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Фильтры</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/БазыРаспределенияЗатрат/БазыРаспределенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БазыРаспределенияЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоОбъемуВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъемуПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПоСтоимостиЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ПоОсновномуСырью</name>
  </enumValues>
  <enumValues>
    <name>ПоНормативам</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НПНК_</name>
      <description>Статьи затрат по структуре Декларации по прибыли</description>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВидЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусМатериальныхЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СтатусыМатериальныхЗатратНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостояннаяЗатрата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет8Класса</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоНалогуНаПрибыль</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СпособыРаспределенияЗатратНаВыпуск/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Процедура заполняет начальные настройки построителя отчетов.
//
Процедура ЗаполнитьНачальныеНастройки(ПостроительОтчета) Экспорт
	
	СтруктураПредставлениеПолей = Новый Структура;
	МассивОтбора = Новый Массив;
	
	Если БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	 ИЛИ БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
	 
	 Текст = " 
		|ВЫБРАТЬ
		|	Подразделения.Ссылка 					КАК Подразделение
		|{ВЫБРАТЬ
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|ИЗ 
		|	Справочник.Подразделения 			КАК Подразделения,
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|{ГДЕ
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|";
	 
	Иначе

		Текст = " 
		|ВЫБРАТЬ
		|	СтатьиЗатрат.ВидЗатрат 					КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат 	КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка 					КАК Подразделение
		|{ВЫБРАТЬ
		|	СтатьиЗатрат.ВидЗатрат.* 				КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат.* КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат.* 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка.* 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|ИЗ 
		|	Справочник.СтатьиЗатрат 			КАК СтатьиЗатрат,
		|	Справочник.Подразделения 			КАК Подразделения,
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|{ГДЕ
		|	СтатьиЗатрат.ВидЗатрат.* 				КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат.* КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат.* 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка.* 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|";
	
	КонецЕсли;
	
	// Соответствие имен полей в запросе и их представлений в отчете.
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Подразделение", 			"Подразделение");
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение организации");
	
	Если БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	   И БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
		СтруктураПредставлениеПолей.Вставить("ВидЗатрат",        		"Вид затрат");
		СтруктураПредставлениеПолей.Вставить("СтатусМатериальныхЗатрат","Статус мат. затрат");
		СтруктураПредставлениеПолей.Вставить("ХарактерЗатрат", 			"Характер затрат");
		СтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", 			"Статья затрат");
	КонецЕсли;
	
	МассивОтбора = Новый Массив;
	Если БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	   И БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
		МассивОтбора.Добавить("ВидЗатрат");
		МассивОтбора.Добавить("СтатусМатериальныхЗатрат");
		МассивОтбора.Добавить("ХарактерЗатрат");
		МассивОтбора.Добавить("СтатьяЗатрат");
	КонецЕсли;
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("ПодразделениеОрганизации");
	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	Если (БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	 ИЛИ БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж)
	   И ПостроительОтчета.Отбор.Количество() > 0 Тогда
	 
		КолвоЭлементов = ПостроительОтчета.Отбор.Количество();
		Для ОбратныйИндекс = 1 По КолвоЭлементов Цикл
	   		ЭлементОтбора = ПостроительОтчета.Отбор[КолвоЭлементов - ОбратныйИндекс];
			
			Если ЭлементОтбора.Имя = "ВидЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "СтатусМатериальныхЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "ХарактерЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "СтатьяЗатрат" Тогда
				ПостроительОтчета.Отбор.Удалить(КолвоЭлементов - ОбратныйИндекс);
			КонецЕсли;

		КонецЦикла;
		   
	КонецЕсли;
	 
	Для Каждого Элемент Из МассивОтбора Цикл
		Если ПостроительОтчета.Отбор.Найти(Элемент) = Неопределено Тогда
			ПолеОтбора = ПостроительОтчета.Отбор.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
